## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| delete   | `aws_ssm_parameter.weblate_github_credentials`               |
| update   | `module.localisation_services.aws_ecs_service.this`          |
|          | `module.localisation_services.aws_iam_policy.this_task_exec` |
| recreate | `module.localisation_services.aws_ecs_task_definition.this`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ssm_parameter.weblate_github_credentials will be destroyed
  # (because aws_ssm_parameter.weblate_github_credentials is not in configuration)
  - resource "aws_ssm_parameter" "weblate_github_credentials" {
      - arn       = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-github-credentials" -> null
      - data_type = "text" -> null
      - id        = "weblate-github-credentials" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "weblate-github-credentials" -> null
      - tags      = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tags_all  = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.localisation_services.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:817721384391:service/localisation-services/weblate"
        name                               = "weblate"
        tags                               = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:32" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.localisation_services.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:32" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  ~ environment            = [
                        # (19 unchanged elements hidden)
                        {
                            name  = "WEBLATE_SOCIAL_AUTH_GOOGLE_OAUTH2_WHITELISTED_DOMAINS"
                            value = "cds-snc.ca"
                        },
                      - {
                          - name  = "WEBLATE_SSH_EXTRA_ARGS"
                          - value = "-p 443"
                        },
                    ]
                  - essential              = true
                    name                   = "weblate"
                  ~ secrets                = [
                        # (4 unchanged elements hidden)
                        {
                            name      = "REDIS_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-auth_token"
                        },
                      - {
                          - name      = "WEBLATE_GITHUB_CREDENTIALS"
                          - valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-github-credentials"
                        },
                        {
                            name      = "WEBLATE_SOCIAL_AUTH_GOOGLE_OAUTH2_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id"
                        },
                        # (3 unchanged elements hidden)
                    ]
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "weblate" -> (known after apply)
      ~ revision                 = 32 -> (known after apply)
        tags                     = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.localisation_services.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id        = "arn:aws:iam::817721384391:policy/weblate_ecs_task_exec_policy"
        name      = "weblate_ecs_task_exec_policy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:DescribeLogStreams",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:817721384391:log-group:/aws/ecs/localisation-services:*"
                    },
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-github-credentials",
                            "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-username",
                            # (4 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
